{
  "0": "It seems like we've been dragging on for a few more days without realizing it",
  "1": "Let's take a look at what fun things to do this week",
  "2": "Technology/Study",
  "3": "A bilingual book on software engineering from Google",
  "4": "An interesting proposal for ECMAScript",
  "5": ":",
  "6": "ViteCof announces list of speakers",
  "7": "Almost all creators and maintainers of interesting projects in the JS ecosystem will participate, which will be held online on October 3rd",
  "8": "Funnay",
  "9": "GitHub global downtime",
  "10": "3613 websites for collecting high-definition logos of companies",
  "11": "However, it seems that we haven't found any logos of domestic companies",
  "12": "If you have a download requirement, you can try imFile",
  "13": "Other",
  "14": "Let's take a look at some immortal companies in Xiamen:",
  "15": "Yihua Technology: Sea view office, flexible working hours, no clock in, six insurances and one fund (additional commercial insurance), annual physical examination, gift cards for festivals and holidays, daily afternoon tea, extra long annual leave+paid sick leave, key employee stock ownership plan",
  "16": "Lingsheng: Flexible working hours, no clock in, long-term work from home, 15-20 days of annual leave, free shuttle bus, lunch subsidy, afternoon tea and leisure snacks provided, starting from 14 yuan",
  "17": "Mengjia Network: A small number of game companies that recruit specialists with decent benefits (overseas), six insurances and one fund, meal subsidies, talent subsidies, 50% off rental housing, shuttle buses, team bonuses, project bonuses, and general salary increases",
  "18": "ABB China: includes food and accommodation, shuttle bus transportation, regular medical examinations, five insurances and one fund (supplementary medical insurance), various subsidies (seniority bonus, attendance bonus, overtime allowance, bonus commission), holiday benefits, 16-17% salary",
  "19": "Some companies with strong Internet flavor/Banxian companies:",
  "20": "Meitu: Super competitive salary level quarterly bonus, multiple positions, project bonus, quarterly bonus, 5-day 7.5-hour work system, paid sick leave, rich team building, monthly departmental activity funds, 15% salary",
  "21": "Seal Information (Fun): Competitive salary level, six insurances and one fund, marriage and childbirth gifts, team building tourism, holiday gifts, gym, yoga studio, performance bonus, regular general adjustment, 13 salary",
  "22": "Meiyu: Competitive salary level, female friendly company, paid sick leave, holiday benefits, Women's Day and menstrual leave care, rich team building, 14 salary",
  "23": "Beipiao and Hubo seem to be more than just talking 😮 ‍ 💨",
  "24": "Live/Work",
  "25": "Last week, I took two days off and went home, which can be considered as a short vacation and a period of rest.",
  "26": "Apart from playing time, the remaining time at the company is spent on reviewing company documents and conducting research.",
  "27": "It is worth mentioning that regarding low code, I have only heard of it before and have not actually used it. Last two weeks, I used the company's low code platform to develop forms on site, and I felt it was okay and not that difficult to use. Mainly about the use of some component libraries.",
  "28": "Here are some low code platforms (open source) that I have collected. I would like to take a look at the implementation source code when I have time to learn more:",
  "29": "Baidu Amis",
  "30": "Alibaba Low Code Engine: Low Code Core",
  "31": "Flying Ice: Generate Source Code Type"
}