{
  "0": "I'm about to enter my junior year, and I only have two years left in college.",
  "1": "Technology/Study",
  "2": "Understand what remote living is",
  "3": "This should be considered a highly publicized technological upgrade in recent years, and has little to do with the front-end. Just treat it as extracurricular knowledge",
  "4": "General knowledge of cross segment technology",
  "5": "One sentence summary is: I know what I want, but I don't have the ability to render. I need to notify someone who has the ability to render to help me render.",
  "6": "GISCUS",
  "7": "Gitalk upgraded version utilizes Dicussion and has a more attractive style.",
  "8": "Ruan Yifeng's Network Log",
  "9": "Ruan Yifeng is also a big shot in the IT industry, and from entry-level to work, he can hardly do without his documents.",
  "10": "Super Interview: Dialogue with Zhang Xuefeng",
  "11": "Regarding the interview of Geek Time with Zhang Xuefeng, the CTO of Ele.me, sometimes looking at the careers of some big shots and thinking about why they are so successful.",
  "12": "Next.js Conf",
  "13": "On October 24th, let's see what new research and development is creating the future",
  "14": "Reading",
  "15": "I finished reading 'Brothers' recommended by my classmate this week, which was also written by Yu Hua. The evaluation is",
  "16": "Better than 'To Live'",
  "17": ".",
  "18": "Brothers \"is divided into two parts, with the upper part mainly focusing on the tragic experiences of the protagonist's family during the Cultural Revolution, which is heartbreaking. The word count in the lower part is much larger than that in the upper part, but there is only text and no content. The main content is that after the reform, Li Guangtou rose to great success and showed mercy everywhere, even holding absurd beauty contests and flirting with his brother and wife Lin Hong. But his brother Song Gang was getting worse year by year, surviving everywhere, but in the end, he committed suicide because of Lin Hong lying on the rails.",
  "19": "Regarding the comparison before and after the Cultural Revolution, \"Ordinary World\" provides a much better description of the protagonist Sun Shao'an's family than \"Brothers\". The keen capture of reform and opening up and bold actions of Sun Shao'an in Lu Yao's works",
  "20": "People who eat crabs",
  "21": "The spirit, even the depiction of Shao'an's love story, is far stronger than 'Brothers'.",
  "22": "What makes me even more uncomfortable is that Yu Hua's straightforward and unabashed vulgar descriptions flood the entire book.",
  "23": "Coding",
  "24": "This week, I mainly did two things. One was the renovation of the scaffolding, replacing all marked with remark and adding a one click translation command. Another thing is that the comment section has been renovated and replaced with an updated version that looks better",
  "25": ".",
  "26": "I have to mention",
  "27": "In compiling this section, it is the god in the god"
}