{
  "0": "Eating and drinking",
  "1": "Mix noodles and clay jars, even breakfast in hotels can be served with mix noodles and clay jars",
  "2": "Boiled in water and fried in oil is Spicy Hot Pot fried string. Jiangxi spicy food is not inferior to Chongqing, it has hurt me these days",
  "3": "By the way, there are also fried bananas that are as dark as roasted oranges, but surprisingly good.",
  "4": "Play and have fun",
  "5": "The main focus of tourism is check-in, and checking in at the destination seems to have become the main theme of tourism nowadays.",
  "6": "But it has to be said that the power of holidays cannot be underestimated, squeezing people and killing people. Nanchang even gave me the illusion that there are more people than Chongqing, Changsha, and Wuhan, and there is no place to stop on the subway every night.",
  "7": "Fortunately, the weather is good, sunny, the wind is strong and comfortable, and the temperature is not very high.",
  "8": "The fountain performance at Qiushui Square and Tengwang Pavilion show that there are really many, many people. It's worth mentioning that don't be fooled by the crowd. I followed the crowd to the wrong place for another fountain performance and almost missed watching.",
  "9": "The campus is very big, bigger than my school, and they have shared electric vehicles, which are much more convenient than my school bus.",
  "10": "There really is one in the White Deer Guild Hall 🦌， Unfortunately, for some unknown reason, only one end remains.",
  "11": "Bayi Square Monument, like Monument to the people's Liberation",
  "12": "summary",
  "13": "Poor student party, even those who become office workers in the future, can only squeeze with the same unfortunate people during holidays. Just to clock in at a certain place and prove that you have been there.",
  "14": "A large number of people may satisfy the Chinese people's innate desire for excitement, and at the same time, they will be upset when people are crowded and people in front of them stagnate,",
  "15": "In fact, most parts of the country are pretty good. Ancient buildings decorated with lights, night markets composed of Stinky tofu and ice powder Liangpi, Tomatoes on sticks and shopping malls of Shibu Yijia can be seen everywhere.",
  "16": "What matters is not where to go, but who to go with."
}