{
  "0": "Farewell to the old year, welcome the auspicious snow, and embark on a new journey in the new year of the Ming Dynasty",
  "1": "I'm going back to Chongqing for the final semester. Although I've only been away from school for over a month, I feel like campus life has been away from me for a long time. The pressure of the final week is the last campus atmosphere that the school brings me.",
  "2": "Let's take a look at what interesting things we have this week",
  "3": "Techology/Study",
  "4": "Thirteen beneficial Chrome plugins for development",
  "5": "AI driven web UI automation testing framework",
  "6": "Every year at the end of the year, there should be a GitHub summary, and I feel that I did a good job this year",
  "7": "github 2024",
  "8": "A local software for full-text search of local files",
  "9": "Article",
  "10": "As Martin Fowler observed, the programming productivity of programmers cannot be effectively measured because it does not exist.",
  "11": "Software development is not an activity that necessarily generates anything.",
  "12": "Assuming you have two developers working on the same project and coincidentally, they both received the same task on the same day.",
  "13": "A wrote a 1000 line framework that perfectly solved this problem. The code is well written and thoroughly tested, with detailed records of every step.",
  "14": "On that day, Yi went to the park, fed pigeons while thinking about problems, and then strolled back to the office, deleting 100 lines of code and deploying changes The problem has been solved.",
  "15": "May I ask whose productivity is higher?",
  "16": "The answer is, it's not important. The important thing is that B solved the problem while reducing the long-term maintenance costs of the team. A also solved this problem, but he increased maintenance costs by adding code, so (all other conditions being equal) his solution is poor.",
  "17": "Can we say that B has higher productivity? Obviously, it is difficult to find the correct measure of programming productivity.",
  "18": "I believe that what excellent software developers do is solve problems** However, productivity measures such as code, documentation, data, etc. are only tools for solving problems, not the problem itself.",
  "19": "Live",
  "20": "Recently, I happened to be researching frameworks related to single testing and came across an article about JS stack tracing, which happens to be related to Ssfi in Chai.",
  "21": "JavaScript Errors and Stack Traces in Depth",
  "22": "I have also watched many classic animated films from the past few weeks, such as the Dragon Taming Master and the Invincible Destruction King series. The fundamental reason why they seem so attractive is probably the contrast between their appearance and inner cuteness, and of course, it cannot be separated from the plot and character portrayal of the movie itself."
}