{
  "0": "Don't be fooled by the fact that you only have two extra days of work per week, it feels like you've lost hope during the week of single day off.",
  "1": "Life",
  "2": "Working hours pass by so quickly, just like summer vacation, they end on a weekly basis. I feel like I haven't done anything, this week is over. In some 📕 Working in the IDE architecture team can be both easy and difficult. I no longer deal with products every day, but rather with external developers. Correcting bugs one by one is a bit like open source.",
  "3": "When it comes to the difference between the business of a certain group, the end of work time is later, it's not as easy to fish for, and the relative MT has become better. It has taught me step by step, teaching me how to solve a type of problem through one problem. Take me to understand the entire IDE chain, its architecture, and its functions.",
  "4": "At least so far, it feels more meaningful than the previous internship.",
  "5": "By the way, I get tired of eating snacks and drinks every day, and even take them home and put them in a big basket 🤫🤫",
  "6": "Entertainment",
  "7": "Suddenly, I started reading a novel. First, I finished reading Tomato's \"Ten Days End\". According to my rating on Douban, I might only give it 6.5 points, and even this 6.5 point is for the top 30% of the content in this book. The rest is even worse. The script is clich é d, the content is messy, and the character design is ruined. I can only say how good the beginning is and how bad the end is. I went to watch 'Lord of the Mysteries' again these days, and I can only say that those who spend money are good.",
  "8": "I haven't finished watching 'Battle of Two Cities 2' yet, but it's said to be unfinished...",
  "9": "Study/Techology",
  "10": "The learning content is mostly about work, such as the architecture composition of xhsIDE, the principles of debugger/IDE, communication between debugger simulators, how to debug a bug, and so on.",
  "11": "After this internship is over, there will also be a summary (should be)"
}